app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `username` = 'wasedino'
 LIMIT 1
---
    public function login()
    {
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $userModel = new UserModel();

        $user = $userModel
            ->where('username', $username)
            ->first();