app/Controllers/Tasks.php

    public function index()
    {
        $taskModel = new TaskModel();

        $data['tasks'] = $taskModel
            ->where('is_archived', 0)
            ->orderBy('task_date', 'ASC')
            ->findAll();
---
SELECT *
FROM `tasks`
WHERE `is_archived` = 0
ORDER BY `task_date` ASC

    public function store()
    {
        $rules = [
            'title'     => 'required',
            'task_date' => 'required'
        ];

        if (! $this->validate($rules)) {
            return redirect()->to('/tasks/new')
                ->withInput()
                ->with('errors', $this->validator->getErrors());
        }

        $taskModel = new TaskModel();

        $taskModel->insert([
            'title'       => $this->request->getPost('title'),
            'status'      => $this->request->getPost('status'),
            'task_date'   => $this->request->getPost('task_date'),
            'is_archived' => 0,
            'created_at'  => date('Y-m-d H:i:s')
        ]);
---
INSERT INTO `tasks` (`title`, `status`, `task_date`, `is_archived`, `created_at`) VALUES ('Php Code', 'pending', '2026-10-03', 0, '2026-10-03 13:19:24')

    public function edit($id)
    {
        $taskModel = new TaskModel();

        $data['task'] = $taskModel->find($id);
---
SELECT *
FROM `tasks`
WHERE `tasks`.`id` = '3'